[
    {
        "id":1,
        "name":"Black pepper chicken & lemon yogurt",
        "img":"https://images.immediate.co.uk/production/volatile/sites/30/2023/09/Black-PepperChicken-e1accb3.jpg?quality=90&webp=true&resize=600,545",
        "description":"A vibrant and flavorful dish that brings together the warmth of aromatic spices and the zesty freshness of citrus. Tender chicken pieces are marinated and cooked in a rich blend of black pepper, garlic, and other spices, creating a savory and slightly spicy base. The dish is balanced beautifully with a cool, creamy lemon yogurt sauce, which adds a refreshing tanginess that complements the peppery heat. Perfectly suited for both casual dinners and special occasions, this dish offers a delightful contrast of flavors and textures that is sure to satisfy your taste buds.",
        "ingredients":[
            "1 tbsp black peppercorns",
            "5 garlic cloves, grated, plus 1 whole garlic bulb",
            "1 tsp ground turmeric",
            "2 lemons, 1 juiced, plus extra wedges to serve",
            "1 ½ kg whole chicken, spatchcocked (see tip, below)",
            "1 tbsp olive oil",
            "400g Greek yogurt",
            "small bunch of coriander, roughly chopped (optional)",
            "peppered rice, to serve (see 'goes well with')"
        ],
        "directions":[
            "Crush the peppercorns using a pestle and mortar. Add the grated garlic and ½ tsp salt, and mash to a thick paste. Stir in the turmeric and lemon juice, then set aside.",
            "Sit the chicken in a dish, skin-side up, and evenly slash the skin all over. Rub the marinade all over the chicken so it’s completely coated, then cover and chill for at least 1 hr, or ideally overnight.",
            "Heat the oven to 220C/200C fan/gas 7. Transfer the chicken to a shallow roasting tray, skin-side up, and sit the garlic bulb alongside it. Drizzle the oil mostly over the chicken and a little over the garlic. Roast for 30 mins, then remove the garlic bulb from the tray and set aside. Continue to roast the chicken for 10-15 mins more, or until crisp-skinned and cooked all the way through. If you have a cooking thermometer, it should read at least 65C when inserted into the breast, and 70C in the thigh. Leave the chicken to rest, uncovered, for 10-15 mins in the tray.",
            "Meanwhile, peel and squeeze the garlic from the roasted bulb into a bowl, then mix in the yogurt. When the chicken has rested, lift it onto a board and stir all the resting pan juices into the yogurt. Taste the yogurt for seasoning, adding a bit more lemon juice if needed. Slice the chicken into pieces and serve scattered with coriander, if using, alongside the yogurt sauce, peppered yellow rice (see recipe, below) and lemon wedges on the side, if you like."
        ]
    }
 ]